#include <stdio.h>
#include <stdlib.h>

int main()
{
    /* Попълнете масив NxN елемента и го попълнете с числа.
    -	Изкарайте елементите на главния диагонал
    -	Изкарайте елементите на второстепенния диагонал
    -	Изведете елементите над главния диагонал
    -	Изведете елементите под главния диагонал   */


    int array[3][3] = {
        {1, 2, 3},
        {4, 5, 6},
        {7, 8, 9}
    };

    int i, j;

    for (i = 0; i < 3; i++) {
        printf("%d\n", array[i][i]);
    }

    printf("\n");

    for (i = 0; i < 3;) {
        for (j = 2; j >= 0;) {
            printf("%d\n", array[i][j]);
            i++;
            j--;
        }
    }


    return 0;
}
