#include <stdio.h>
#include <stdlib.h>

int main()
{
    /* Да се състави програма, чрез която се въвеждат 7 цели числа от интервала [-5000..5000] в едномерен масив.
    Програмата да изведе числото, което е най-близко до средната стойност на въведените числа и къде се намира.
    Пример: 1,2,3,4,5,6,7
    Изход: средна стойност 4, най-близка стойност 4 на 4-то място   */

    int list[7] = {1, 2, 3, 4, 5, 6, 7};
    float average;
    int i;

    for (i = 0; i < 7; i++) {
        average += list[i];
    }

    average = average / 7;

    return 0;
}
